export const interviewQuestions = [
  {
    question: "개발자가 되기로 결심한 계기는 무엇인가요?",
    answer: "저는 컴퓨터와 밀접한 유년기를 보냈습니다. 단순히 게임을 즐기는 것이 아닌, ‘이 프로그램은 어떻게 만들어졌을까?, 0과 1로 이루어졌다는 컴퓨터에서 이러한 복잡성이 어떻게 나오는 것을까?’라는 근본적인 질문을 던지곤 했습니다. 대학에서 소프트웨어 공학을 전공하며 이러한 호기심을 해결하며 저의 진로를 확신하게 되었습니다. 또한, 사용자에게 가치있는 서비스에 대해 고민하고, 코드를 통해 아이디어를 구현하는 과정에서 흥미와 보람을 느끼는 저를 보며 개발자의 길을 가겠다고 다짐하게 됐습니다."
  },
  {
    question: "협업 경험에 대해 말씀해주세요.",
    answer: "저는 팀 프로젝트를 진행하며 협업의 중요성을 깨달았습니다. 특히 카카오 테크 캠퍼스 과정 중 진행했던 팀 프로젝트에서 깃허브를 활용하여 버전 관리 방법에 대해 배우고, 매일 스크럼 회의를 통해 진행 상황을 공유하며 의견을 조율하며 개발자의 협업이란 무엇인지, 어떻게 하는 것인지 알았습니다. 그 중 서로의 코드리뷰를 통해 더 나은 코드를 만들어가며 성장하는 과정은 매우 특별한 경험이었습니다."
  },
  {
    question: "본인의 강점과 약점은 무엇이라고 생각하시나요?",
    answer: "저의 가장 큰 장점은 깊이 있는 탐구심과 도전적인 실행력입니다. 단순한 기능 구현에 머무르지 않고, 코드의 동작 원리를 파악하고 개선점을 파악하고자 노력합니다. 새로운 기술을 접했을 때도 부딫혀보자는 자세로 기술을 적용해보고 기존 방식과의 차이를 파악하는 과정을 즐깁니다. 저의 단점은 꼼꼼하지 못한 것 입니다. 이로 인해 변수 1~2개씩 변수명 규칙을 안지킨다던가, 오타가 발생하는 등의 실수들을 하곤 합니다. 이를 방지하기 위해 사소한 일이라도 하고 나서 더블 체크를 하는 습관을 들여 실천하고 있습니다."
  }
];